//#include "Header.h"
//
//void main()
//{
//
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);
//	int a = 0;
//
//	char key = ' ';
//	char mainMenu = '1';
//	while (mainMenu != '3')
//	{
//		char m = '1';
//		while (m != 13)
//		{
//			if (m == '1')
//			{
//				Color(10);	cout << "==>";
//			}
//			else
//			{
//				Color(7); cout << "  ";
//			}
//			cout << "1. Прямокутник\n";
//			if (m == '2')
//			{
//				Color(10); cout << "==>";
//			}
//			else
//			{
//				Color(7); cout << "  ";
//			}
//			cout << "2. Трикутник\n";
//
//			if (m == '3')
//			{
//				Color(10);	cout << "==>";
//			}
//			else
//			{
//				Color(7); cout << "  ";
//			}
//			cout << "3. Вихід з меню\n";
//			Color(10);
//			cout << "--------------------------------------------" << endl;
//
//			m = _getch();
//			if (m != 13)
//			{
//				mainMenu = m;
//			}
//			system("cls");
//			Color(7);
//		}
//
//		switch (mainMenu)
//		{
//		case '1':
//		{
//			key = ' ';
//			Figure f1, f2, f3;
//			
//			while (key != '8')
//			{
//				Color(14);
//				cout << "==================================================================================================" << endl;
//				cout << "Заповнити дані про фігури натисніть клавішу                                                      +" << endl;
//				cout << "Вивести в консолі всі фігури натисніть клавішу                                                   0" << endl;
//				cout << "Перевірити,чи Фігура 1 більша за Фігуру 2 натисніть клавішу                                      1" << endl;
//				cout << "Перевірити,чи Фігура 1 дорівнює Фігурі 3 натисніть клавішу                                       2" << endl;
//				cout << "Перевірити,чи Фігура 2 менша за Фігуру 3 натисніть клавішу                                       3" << endl;
//				cout << "Додати до Фігури 1 число,яке введе користувач натисніть клавішу                                  4" << endl;
//				cout << "Додати до Фігури 1 Фігуру 2 натисніть клавішу                                                    5" << endl;
//				cout << "Відняти від Фігури 2 Фігуру 3 натисніть клавішу                                                  6" << endl;
//				cout << "Фігури 1 стане рівна Фігуру 2 натисніть клавішу                                                  7" << endl;
//				cout << "Для виходу з цього пункту меню  натисніть клавішу                                                8" << endl;
//				cout << "==================================================================================================" << endl;
//				Color(7);
//				key = _getch();
//				system("cls");
//
//				if (key == '1')
//				{
//
//					if (f1 > f2)
//					{
//						cout << "Фігура 1 за площею більша за Фігуру 2 " << endl;
//					}
//					else
//					{
//						cout << "Фігура 1 точно не більша за Фігуру 2 " << endl;
//					}
//
//				}
//				if (key == '2')
//				{
//					if (f1 == f3)
//					{
//						cout << "Фігура 1 рівна Фігурі 3 " << endl;
//					}
//					else
//					{
//						cout << "Фігура 1 точно не рівна за Фігурі 3 " << endl;
//					}
//
//				}
//				if (key == '3')
//				{
//
//					if (f2 < f3)
//					{
//						cout << "Фігура 2 за площею менша за Фігуру 3 " << endl;
//					}
//					else
//					{
//						cout << "Фігура 2 точно не менша за Фігуру 3 " << endl;
//					}
//				}
//				if (key == '4')
//				{
//					cout << "Вкажіть значення,на яке буде проводитись збільшення : " << endl;
//					cin >> a;
//					f1 += a;
//					system("cls");
//					f1.Show_rectangle();					
//				}
//				if (key == '5')
//				{
//					f1.Show_rectangle();//вивела перший.
//					f2.Show_rectangle();//вивела другий.					
//					system("cls");
//					_getch();
//					Figure f4 = f1 + f2;
//					f4.Show_rectangle();//вивела суму двох.
//				}
//				if (key == '6')
//				{
//					f2.Show_rectangle();//вивела другий.
//					f3.Show_rectangle();//вивела третій.					
//					system("cls");
//					_getch();
//					Figure f5 = f2 - f3;
//					f5.Show_rectangle();//вивела різницю двох.при мінусі візьме модуль.
//
//					
//				}
//				if (key == '7')
//				{
//					f1.Show_rectangle();//вивела перший.
//					f2.Show_rectangle();//вивела другий.					
//					system("cls");
//					_getch();
//					Figure f1 = f2;
//					f1.Show_rectangle();
//
//				}
//
//				if (key == '0')
//				{
//					f1.Show_rectangle();//вивела перший.
//					f2.Show_rectangle();//вивела другий.					
//					f3.Show_rectangle();//вивела третій.
//				}
//					
//
//				if (key == '+')
//				{
//					f1.Enter_rectangle();//заповнення першого прямокутника.
//					f2.Enter_rectangle();//заповненя другого прямокутника.
//					f3.Enter_rectangle();//заповнення третього прямокутника.
//				}
//				_getch();
//				break;
//
//			}
//
//			break;
//		}
//
//		case '2':
//		{   //Зробила тільки додавання,бо витратила багато часу на малювання ромба і самих триутників.
//			Figure f6, f7;//саме гарно видиться,якщл один трикутник висотою 3 ,а другий 4.
//			f6.Enter_triangle();//заповнення першого трикутника.
//			f7.Enter_triangle();//запонення другого трикутника.
//			system("cls");
//
//			f6.Show_triangle();//виводимо перший трикутник.
//			f7.Show_triangle_inverted();//виводимо другий трикутник.
//			_getch();
//			system("cls");
//
//			Figure f8 = f6 + f7;
//			f8.Show_rectangle_res();//сума трикутників(виведеться ромбом).Особливо не мудрувала.
//
//			_getch();
//			break;
//
//		}
//		case '3':
//		{
//			Color(12);
//			cout << " До побачення! Може все і не ідеально,але дякую,що переглянули) " << endl;
//			Color(7);
//			_getch();
//			break;
//		}
//		default:
//		{
//			Color(12);
//			cout << "Перевірте правильність введених вами даних\n";
//			break;
//			Color(7);
//		}
//		}
//		if (m == '3') break;
//		system("cls");
//
//
//	}
//
//
//
//
//}
//
//
//
//
//
//










