
//#include "Stack.h"


//Дано чотири стеки.
//Два перших стеки порожні, а в двох інших знаходяться випадкові натуральні(> 0) числа.
//В перший порожній стек помістити парні числа в порядку зростання, взяті з двох непорожніх стеків,
//у другий порожній стек помістити непарні числа в порядку спадання, так само взяті з непорожніх стеків.
//Можна перекидати елементи зі стеку в стек, головне щоб в результаті було два заповнених стеки, як описано вище, з мінімальною кількістю операцій
//Можна використати стек з STL
//
//
//void main()
//{
//
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	srand(time(NULL));
//	stack<int> st1;
//	stack<int> st2;
//	stack<int> st3;
//	stack<int> st4;
//	stack<int> st5;
//	stack<int> st6;
//
//	int n;
//	cout << "Вкажіть розмір Стека 3 : " << endl;
//	cin >> n;
//	
//	for(int i=0;i<n;i++)
//	{		
//		st3.push(rand()%40);				
//	}
//	cout << " Розмір Стека 3 :  "  << st3.size() << endl;
//
//	int num;
//	cout << "Вкажіть розмір Стека 4 : " << endl;
//	cin >> num;
//
//    for(int i=0;i<num;i++)
//	{		
//		st4.push(rand() % 50) ;
//	}
//	cout << " Розмір Стека 4  :  " << st4.size() << endl;
//	cout << endl;
//	
//	//Розподіл на парні і не парні.
//  while ((!st3.empty()) && (!st4.empty()))//поки стеки заповнені.
//	{		
//	while (!st3.empty())
//	{
//		if (st3.top() % 2 == 0)//якщо парний елемент третього стека
//		{
//			st1.push(st3.top());//то записую в перший стек
//
//		}
//		else
//		{
//			st2.push(st3.top());//якщо непарний елемент третього стека,то відповідно- другий стек.
//
//		}
//		st3.pop();
//	}
//
//	while (!st4.empty())
//	{
//		if (st4.top() % 2 == 0)//якщо парний елемент четвертого стека.
//		{
//			st1.push(st4.top());//вношу у перший стек.
//
//		}
//		else 
//		{
//			st2.push(st4.top());//якщо непарний елемент четвертого стека,то відповідно - в другий стек.
//
//		}
//		st4.pop();
//	}
//		
//  }
//	
//	
//  while (!st1.empty())
//  {
//	  st3.push(st1.top());//переношу елелменти з стек 1 в стек 3.
//	  st1.pop();
//
//	  while (!st1.empty())//поки стек заповнений.
//	  {
//
//		  if (st1.top() > st3.top())//якщо значення стек 1 більше стек 3.
//			  st3.push(st1.top());//заношу в те 3.
//		  else
//			  st4.push(st1.top());//інакше заношу в стек 4.
//		  st1.pop();
//	  }
//	  while (!st3.empty())//поки стек 3 повний.
//	  {
//		  st1.push(st3.top());//заношу дані в стек 1 назад.
//		  st3.pop();
//	  }
//	  if (st4.empty())//якщо стек 4 порожный,перериваэмо.
//		  break;
//	  while (!st4.empty())//інакше(якщо повний стек 4)
//	  {
//		  st1.push(st4.top());//заношу елементи в стек 1,
//		  st4.pop();
//	  }
//  }
//
//     cout << " Стек 1 парні числа,відсортовані по зростанню " << endl;
//	 while (!st1.empty())
//	 {
//		cout<< st1.top()<<" ";//вивела результат.
//		 st1.pop();
//	 }
//	 cout << endl;
//
//
//	 //аналогічно як зверху,поміняла знак більше на знак менше і все.
//	 while (!st2.empty())
//	 {
//		 st6.push(st2.top());
//		 st2.pop();
//		 while (!st2.empty())
//		 {
//
//			 if (st2.top() < st6.top())
//				 st6.push(st2.top());
//			 else
//				 st5.push(st2.top());
//			 st2.pop();
//		 }
//		 while (!st6.empty()) {
//			 st2.push(st6.top());
//			 st6.pop();
//		 }
//		 if (st5.empty())
//			 break;
//		 while (!st5.empty())
//		 {
//			 st2.push(st5.top());
//			 st5.pop();
//		 }
//
//	 }	 	 	   
//	 cout << " Стек 2 непарні числа,відсортовані по спаданню" << endl;
//	 while (!st2.empty())
//	 {
//		 cout << st2.top() << " ";//вивела результат.
//		 st2.pop();
//	 }
//
//
//
//
//}
	

