//#include "Header_vector.h"
//
//
//int main()
//{
//	srand(time(NULL));
//
//	SetConsoleCP(1251);
//	SetConsoleOutputCP(1251);
//	HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);
//
//	int n = 0;
//	cout << "Введіть розмір Вектора 1   ";
//	cin >> n;
//
//	int* a = new int[n];//гнуло мати,поки не виділила пам"ять так.Але робить норм.
//
//	for (int i = 0; i < n; i++)
//		a[i] = i;
//
//
//
//
//	int n2 = 0;
//	cout << "Введіть розмір Вектора 2   ";
//	cin >> n2;
//
//	int* b = new int[n2];//гнуло мати,поки не виділила пам"ять так.Але робить норм.
//
//	for (int i = 0; i < n2; i++)
//		b[i] = i;
//
//
//	Vector<int>v(n, a, 0);//створила екземпляр.
//	v.Set_Elem();
//	Vector<int>v2(n2, b, 0);//створила другий.
//	v2.Set_Elem();
//
//
//
//	char key = ' ';
//	char mainMenu = '1';
//	while (mainMenu != '2')
//	{
//		char m = '1';
//		while (m != 13)
//		{
//			if (m == '1')
//			{
//				Color(10);	cout << "==>";
//			}
//			else
//			{
//				Color(7); cout << "  ";
//			}
//			cout << "1. Розпочати операції \n";
//			if (m == '2')
//			{
//				Color(10);	cout << "==>";
//			}
//			else
//			{
//				Color(7); cout << "  ";
//			}
//			cout << "2. Вихід \n";
//
//			cout << "--------------------------------------------" << endl;
//
//			m = _getch();
//			if (m != 13)
//			{
//				mainMenu = m;
//			}
//			system("cls");
//			Color(7);
//		}
//
//		switch (mainMenu)
//		{
//					   			 		  		  		 	   			
//		   case '1':
//		   {
//			   key = ' ';
//
//						
//
//			   while (key != '*')
//			   {
//				   Color(14);
//				   cout << "==================================================================================================" << endl;
//				   cout << "Заповнити Вектор 1 та Вектор 2 натиснути клавішу                                                 1" << endl;
//				   cout << "Перевірити,чи Вектор 1 більший за Вектор 2 натисніть клавішу                                     2" << endl;
//				   cout << "Перевірити,чи Вектор 1 дорівнює Вектору 2 натисніть клавішу                                      3" << endl;
//				   cout << "Перевірити,чи Вектор 1 НЕ дорівнює Векору 2 натисніть клавішу                                    4" << endl;
//				   cout << "Збільшити елементи Вектора 1 та Вектора 2 на одиницю натисніть клавішу                           5" << endl;
//				   cout << "Зменшити елементи Вектора 1 та Вектора 2 на одиницю натисніть клавішу                            6" << endl;
//				   cout << "Показати кількість елементів Вектора 1 та Вектора 2 натисніть клавішу                            7" << endl;
//				   cout << "Вектор 1 стане рівний Вектору 2 натисніть клавішу                                                8" << endl;
//				   cout << "Оператор виклику функції()для заміни значення по індексу (задати індекс і нове значення)         9" << endl;
//				   cout << "Вийти з меню натиснути клавішу                                                                   *" << endl;
//				   cout << "==================================================================================================" << endl;
//				   Color(7);
//				   key = _getch();
//				   system("cls");
//
//				   if (key == '1')
//				   {
//
//					   cout << "Наш перший масив: " << endl;
//					   v.Show(v);
//					   cout << "=====================" << endl;
//
//					   cout << "Наш перший масив: " << endl;
//					   v2.Show(v2); 
//
//				   }
//				   if (key == '2')
//				   {
//
//					   cout << "Наш перший масив: " << endl;
//					   v.Show(v);
//					   cout << "=====================" << endl;
//
//					   cout << "Наш перший масив: " << endl;
//					   v2.Show(v2);
//
//					   if (v > v2)
//						   cout << "Сума елементів Вектора 1 більше суми елементів Вектора 2" << endl;
//					   else
//						   cout << "Сума елементів Вектора 1 точно не більше суми елементів Вектора 2 " << endl;
//				   }
//				   if (key == '3')
//				   {
//
//					   cout << "Наш перший масив: " << endl;
//					   v.Show(v);
//					   cout << "=====================" << endl;
//
//					   cout << "Наш перший масив: " << endl;
//					   v2.Show(v2);
//
//					   if (v == v2)
//						   cout << "Елементи Векора 1 дорівнюють елементам Вектора 2" << endl;
//					   else
//						   cout << "Елементи Вектора 1 точно не дорівнюють елементам Вектора 2 " << endl;
//				   }
//				   if (key == '4')
//				   {
//
//					   cout << "Наш перший масив: " << endl;
//					   v.Show(v);
//					   cout << "=====================" << endl;
//
//					   cout << "Наш перший масив: " << endl;
//					   v2.Show(v2);
//
//					   if (v != v2)
//						   cout << "Елементи Векора 1 не дорівнюють елементам Вектора 2" << endl;
//					   else
//						   cout << "Елементи Вектора 1 точно  дорівнюють елементам Вектора 2 " << endl;
//				   }
//				   if (key == '5')
//				   {
//					   cout << "Перший вектор" << endl;
//					   v.Show(v);
//					   cout << "Другий ветор" << endl;
//					   v2.Show(v2);
//					   v++;
//					   v2++;
//					   cout << "Перетворені елементи" << endl;
//					   v.Show(v);
//					   v2.Show(v2);
//				   }
//				   if (key == '6')
//				   {
//					   cout << "Перший вектор" << endl;
//					   v.Show(v);
//					   cout << "Другий ветор" << endl;
//					   v2.Show(v2);
//					   v--;
//					   v2--;
//					   cout << "Перетворені елементи" << endl;
//					   v.Show(v);
//					   v2.Show(v2);
//				   }
//				   if (key == '7')
//				   {
//
//					   cout << "Наш перший масив: " << endl;
//					   v.Show(v);
//					   cout << "=====================" << endl;
//
//					   cout << "Наш перший масив: " << endl;
//					   v2.Show(v2);
//
//					   cout << "Кількість елементів Вектора 1  " << v.Get_CountVectors() << "  елементів" << endl;
//					   cout << "Кількість елементів Вектора 2  " << v2.Get_CountVectors() << "  елементів" << endl;
//				   }
//				   if (key == '8')
//				   {
//					   v = v2;
//					   cout << "Перший вектор" << endl;
//					   v.Show(v);
//					   cout << "Другий ветор" << endl;
//					   v2.Show(v2);
//				   }
//				   if (key == '9')
//				   {
//					   v.Show(v);
//					   v2.Show(v2);
//					   v(2, 2);
//					   v2(3, 15);
//					   v.Show(v);
//					   v2.Show(v2);
//				   }
//				   _getch();
//				   break;
//
//			   }
//			   break;
//		   }
//		    case '2':
//		   {
//			    Color(12);
//			    cout << " До побачення! Може все і не ідеально,але дякую,що переглянули) " << endl;
//			    Color(7);
//			    _getch();
//			     break;
//		   }
//		    default:
//		   {
//			     Color(12);
//			     cout << "Перевірте правильність введених вами даних\n";
//			     break;
//			     Color(7);
//		   }
//		}
//		     if (m == '2') break;
//		     system("cls");
//
//
//
//	}
//	
//
//	delete[]a;
//	delete[]b;
//}
